{
  "_name_or_path": "bert-base-multilingual-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "finetuning_task": "token-classification",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "_",
    "1": "ARG0",
    "2": "V",
    "3": "ARG1",
    "4": "ARGM-LOC",
    "5": "ARGM-MOD",
    "6": "ARGM-GOL",
    "7": "ARGM-TMP",
    "8": "ARG2",
    "9": "ARGM-ADV",
    "10": "ARGM-MNR",
    "11": "ARGM-LVB",
    "12": "ARGM-PRR",
    "13": "ARG4",
    "14": "ARGM-NEG",
    "15": "ARGM-EXT",
    "16": "R-ARG0",
    "17": "ARGM-ADJ",
    "18": "R-ARG1",
    "19": "C-V",
    "20": "ARG3",
    "21": "ARGM-COM",
    "22": "ARGM-DIS",
    "23": "ARGM-CAU",
    "24": "ARGM-PRP",
    "25": "ARGM-DIR",
    "26": "ARGM-CXN",
    "27": "C-ARG1",
    "28": "ARGM-PRD",
    "29": "R-ARGM-ADV",
    "30": "R-ARGM-TMP",
    "31": "C-ARG2",
    "32": "ARGM-REC",
    "33": "R-ARGM-LOC",
    "34": "R-ARG2",
    "35": "C-ARGM-CXN",
    "36": "ARG1-DSP",
    "37": "C-ARG1-DSP",
    "38": "R-ARGM-CAU",
    "39": "R-ARGM-MNR",
    "40": "R-ARGM-DIR",
    "41": "C-ARGM-MNR",
    "42": "C-ARGM-LOC",
    "43": "C-ARG4",
    "44": "C-ARG3",
    "45": "R-ARG3",
    "46": "C-ARG0",
    "47": "C-ARGM-TMP",
    "48": "R-ARGM-GOL",
    "49": "C-ARGM-ADV",
    "50": "C-ARGM-EXT",
    "51": "R-ARG4",
    "52": "C-ARGM-COM",
    "53": "C-ARGM-DIR",
    "54": "R-ARGM-COM",
    "55": "ARG5",
    "56": "ARGA",
    "57": "C-ARGM-PRR",
    "58": "C-ARGM-GOL",
    "59": "C-ARGM-PRP"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "0": "_",
    "1": "ARG0",
    "2": "V",
    "3": "ARG1",
    "4": "ARGM-LOC",
    "5": "ARGM-MOD",
    "6": "ARGM-GOL",
    "7": "ARGM-TMP",
    "8": "ARG2",
    "9": "ARGM-ADV",
    "10": "ARGM-MNR",
    "11": "ARGM-LVB",
    "12": "ARGM-PRR",
    "13": "ARG4",
    "14": "ARGM-NEG",
    "15": "ARGM-EXT",
    "16": "R-ARG0",
    "17": "ARGM-ADJ",
    "18": "R-ARG1",
    "19": "C-V",
    "20": "ARG3",
    "21": "ARGM-COM",
    "22": "ARGM-DIS",
    "23": "ARGM-CAU",
    "24": "ARGM-PRP",
    "25": "ARGM-DIR",
    "26": "ARGM-CXN",
    "27": "C-ARG1",
    "28": "ARGM-PRD",
    "29": "R-ARGM-ADV",
    "30": "R-ARGM-TMP",
    "31": "C-ARG2",
    "32": "ARGM-REC",
    "33": "R-ARGM-LOC",
    "34": "R-ARG2",
    "35": "C-ARGM-CXN",
    "36": "ARG1-DSP",
    "37": "C-ARG1-DSP",
    "38": "R-ARGM-CAU",
    "39": "R-ARGM-MNR",
    "40": "R-ARGM-DIR",
    "41": "C-ARGM-MNR",
    "42": "C-ARGM-LOC",
    "43": "C-ARG4",
    "44": "C-ARG3",
    "45": "R-ARG3",
    "46": "C-ARG0",
    "47": "C-ARGM-TMP",
    "48": "R-ARGM-GOL",
    "49": "C-ARGM-ADV",
    "50": "C-ARGM-EXT",
    "51": "R-ARG4",
    "52": "C-ARGM-COM",
    "53": "C-ARGM-DIR",
    "54": "R-ARGM-COM",
    "55": "ARG5",
    "56": "ARGA",
    "57": "C-ARGM-PRR",
    "58": "C-ARGM-GOL",
    "59": "C-ARGM-PRP"
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.26.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
